TexasInstruments/mcupsdk-core/examples/drivers/adc/adc_high_priority_soc/am263px-cc/r5fss0-0_nortos/example.syscfg
const edma                  = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                 = edma.addInstance({}, false);
edma1.$name                 = "CONFIG_EDMA0";
mcspi1.edmaDriver           = edma1;
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC4_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.ADC.AIN0.$suggestSolution              = "ADC0_AIN0";
adc1.ADC.AIN1.$suggestSolution              = "ADC0_AIN1";
adc1.ADC.AIN2.$suggestSolution              = "ADC0_AIN2";
adc1.ADC.AIN3.$suggestSolution              = "ADC0_AIN3";
adc1.ADC.AIN4.$suggestSolution              = "ADC0_AIN4";
adc1.ADC.AIN5.$suggestSolution              = "ADC0_AIN5";
adc2.ADC.AIN0.$suggestSolution              = "ADC1_AIN0";
adc2.ADC.AIN1.$suggestSolution              = "ADC1_AIN1";
adc2.ADC.AIN2.$suggestSolution              = "ADC1_AIN2";
adc2.ADC.AIN3.$suggestSolution              = "ADC1_AIN3";
adc2.ADC.AIN4.$suggestSolution              = "ADC1_AIN4";
adc2.ADC.AIN5.$suggestSolution              = "ADC1_AIN5";
adc3.ADC.AIN0.$suggestSolution              = "ADC2_AIN0";
adc3.ADC.AIN1.$suggestSolution              = "ADC2_AIN1";
adc3.ADC.AIN2.$suggestSolution              = "ADC2_AIN2";
adc3.ADC.AIN3.$suggestSolution              = "ADC2_AIN3";
adc3.ADC.AIN4.$suggestSolution              = "ADC2_AIN4";
adc3.ADC.AIN5.$suggestSolution              = "ADC2_AIN5";
adc4.ADC.AIN0.$suggestSolution              = "ADC3_AIN0";
adc4.ADC.AIN1.$suggestSolution              = "ADC3_AIN1";
adc4.ADC.AIN2.$suggestSolution              = "ADC3_AIN2";
adc4.ADC.AIN3.$suggestSolution              = "ADC3_AIN3";
adc4.ADC.AIN4.$suggestSolution              = "ADC3_AIN4";
adc4.ADC.AIN5.$suggestSolution              = "ADC3_AIN5";
adc5.ADC.AIN0.$suggestSolution              = "ADC4_AIN0";
adc5.ADC.AIN1.$suggestSolution              = "ADC4_AIN1";
adc5.ADC.AIN2.$suggestSolution              = "ADC4_AIN2";
adc5.ADC.AIN3.$suggestSolution              = "ADC4_AIN3";
adc5.ADC.AIN4.$suggestSolution              = "ADC4_AIN4";
adc5.ADC.AIN5.$suggestSolution              = "ADC4_AIN5";
epwm1.EPWM.A.$suggestSolution               = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution               = "EPWM0_B";
mcspi1.SPI.CLK.$suggestSolution             = "SPI1_CLK";
mcspi1.SPI.D0.$suggestSolution              = "SPI1_D0";
mcspi1.SPI.D1.$suggestSolution              = "SPI1_D1";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "SPI1_CS0";
debug_log.uartLog.UART.$suggestSolution     = "UART0";
